Repository: msmannan00/Globaleaks-Angular-Fork
Catalog: documentation/locale/*/LC_MESSAGES/gettingstarted/Glossary.po
Languages: it

source: Glossary
it: Glossario

source: This is a list of jargon used in GlobaLeaks, defined in a way so as to be unambiguous and uniform across all references.
it: Questa è una lista del gergo utilizzato in GlobaLeaks, definito in modo da essere inequivocabile e uniforme in tutti i riferimenti

source: Administrator
it: Amministratore

source: The user that has set up and is maintaining the platform. An Administrator does not have access to Whistleblowers’ reports.
it: L'utente che ha configurato e sta gestendo la piattaforma. L'amministratore non ha accesso alle segnalazioni.

source: Channel
it: Canale

source: The reporting channel intended as a container for reports. Channels can be configured in terms of questionnaire, recipients and policies. They are typically used to organize the reporting procedure.
it: Il canale di segnalazione, inteso come contenitore per le segnalazioni. I canali possono essere configurati in termini di questionario, destinatari e politiche. Sono tipicamente utilizzati per organizzare la " "procedura di segnalazione.

source: Notification
it: Notifica

source: An email sent to notify a recipient of a new report, or an update of an existing report.
it: Un'email inviata per avvisare un destinatario di una nuova segnalazione o di un aggiornamento di una segnalazione esistente.

source: Platform
it: Piattaforma

source: A system running the GlobaLeaks software.
it: Un sistema che esegue il software GlobaLeaks.

source: Questionnaire
it: Questionario

source: A questionnaire is a set of questions that the whistleblower should fill to file a report.
it: Un questionario è un insieme di domande che il segnalatore deve compilare per presentare una segnalazione.

source: Receipt
it: Ricevuta

source: A 16-digits random secret code generated by the system and provided to whistleblowers upon the submission of their report, enabling them to anonymously access and update their report by adding comments and new files.
it: Un codice segreto casuale di 16 cifre generato dal sistema e fornito ai segnalatori al momento della presentazione della loro segnalazione, consentendo loro di accedere in modo anonimo e aggiornare la loro segnalazione aggiungendo commenti e nuovi file.

source: Recipient
it: Ricevente

source: The user enabled to read whistleblowers’ reports. Recipients may also communicate with whistleblowers via the GlobaLeaks platform.
it: L'utente abilitato a leggere le segnalazioni dei segnalatori. I destinatari possono anche comunicare con i segnalatori tramite la piattaforma.

source: Report
it: Segnalazione

source: The object of the submission by a whistleblower including answers to a questionnaire and attached material.
it: L'oggetto della segnalazione da parte di un segnalante, comprese le risposte a un questionario e il materiale allegato.

source: The person who files a report.
it: La persona che presenta una segnalazione.
